{
  "2020": [
    {
      "title": "git",
      "description": "GIT was initially designed and developed by Linus Torvalds for Linux kernel development. GIT is a free software that is designed to handle distributed revision control and source code management system. Easy to learn, it manages anything from small to large projects with speed and efficiency. Every Git clone is a full-fledged repository with complete history. It possess full revision tracking capabilities that are independent of network access or a central server.",
      "url": "https://git-scm.com/downloads"
    },

    {
      "title": "Jenkins",
      "description": "The leading open source automation server, Jenkins provides hundreds of plugins to support building, deploying and automating any project. There are several factors that supports Jenkins to root their base. Continuous Integration, Continuous Delivery, easy installation and easy configuration are few of its highlights. Jerkins can easily distribute work across different machines.",
      "url": "https://jenkins.io/"
    },

    {
      "title": "Docker",
      "description": "Docker is an open platform for developers and system admins to build, ship, and run distributed applications, whether on laptops, data center, VMs, or cloud. Docker containers are based on open standards. The software is wrapped in a complete filesystem that contains anything that can be installed on a server. Docker for Windows is a native Windows application with a native user interface and auto-update capability deeply integrated with Windows native virtualization, Hyper-V, networking and file system, making it faster and more reliable than previous ways of getting Docker on a Windows PC..",
      "url": "https://www.docker.com/"
    },

    {
      "title": "Puppet",
      "description": "Puppet is a configuration management tool that helps system administrators automate provisioning, configuration, and management of a server infrastructure.The tool comes in two flavors basically open source puppet and puppet enterprise. Besides freeing up time to work on projects that deliver more business value, Puppet ensures consistency, reliability and stability. It also facilitates closer collaboration between sysadmins and developers.",
      "url": "https://puppet.com/solutions/devops"
    },

    {
      "title": "Chef",
      "description": "Chef is a configuration management tool for dealing with machine setup on physical servers, virtual machines and in the cloud. Nowadays more companies prefer using chef to align,control and manage their infrastructure. With the use of chef you are benefitted with Accelerated cloud adoption, manage both data center and cloud environments, manage multiple cloud environments andmMaintain high availability.",
      "url": "https://git-scm.com/downloads"
    },

    {
      "title": "Vagrant",
      "description": "Vagrant is an open-source software product for building and maintaining portable virtual development environments. Large projects need to cross the hurdles of multiple technical stacks. This is the core idea behind its creation. Vagrant manages all the necessary configurations for the developers in order to avoid the unnecessary maintenance and setup time, and increases development productivity. ",
      "url": "https://git-scm.com/downloads"
    }
  ]
}
