{
  "2022": [
    {
      "title": "Selenium",
      "description": "Selenium is a set of different software tools, each with a different approach to support test automation. The entire suite of tools results in a rich set of testing functions specifically geared to the needs of testing of web applications of all types. These operations are highly flexible, allowing many options for locating UI elements and comparing expected test results against actual application behavior..",
      "url": "https://engineering.aweber.com/getting-started-with-ui-automated-tests-using-selenium-python/"
    },

    {
      "title": "OWASP Zed",
      "description": "The OWASP Zed Attack Proxy (ZAP), one of the free security testing software, can automatically find security vulnerabilities in web applications while they are in developing and testing phases. It is also a great tool for experienced pentesters e for manual security testing.",
      "url": "https://www.owasp.org/index.php/OWASP_Zed_Attack_Proxy_Project"
    },

    {
      "title": "Dareboost",
      "description": "Dareboost is designed for triggering insightful audit of the website on quality and performance . DareBoost detects the root causes of slowdowns and provides tailor-made suggestions to fix them. It provides a comprehensive report of the website performance and quality, with real browser metrics and top of the range tips to drive optimization in a few seconds. Dareboost also carry out website monitoring and speed comparison for competitive advantage.",
      "url": "https://www.dareboost.com/en/home"
    },

    {
      "title": "Seo Site CheckUp",
      "description": "SeoSiteCheckUp provides a set of advanced seo analyzer tools that gives webmasters in-depth seo analysis of the website’s seo ranking in a page-by-page basis. It also tracks the website social media ranking, site usability, online reputation, meta tags, and site speed. One can get the analysis report of their website instantaneously using this online platform.",
      "url": "https:https://seositecheckup.com/"
    },

    {
      "title": "TestRail",
      "description": "TestRail is a holistic web based Test Management tool helps to manage,track and organize Software Testing. It aims to manage test runs and coordinate the entire testing process. It tracks and follows the status of individual tests, milestones and projects with dashboards and activity reports.",
      "url": "http://www.gurock.com/testrail/"
    },

    {
      "title": "iMacros",
      "description": "iMacros can automate whatever you do with a web browser from web automation/web scripting, to data extraction, to web testing, and much more. It is the only web automation software that works with every website.They record and handles repetitive works easily. In short they handle functional, performance, and regression testing of web applications.",
      "url": "https://imacros.net/"
    },

    {
      "title": "W3 STANDARD",
      "description": "The W3C API is a read-only Web API based on the JSON format exposing only public data.",
      "url": "https://www.w3.org/developers/tools/"
    },

    {
      "title": "MOBILE FRIENDLY",
      "description": "This is Google’s online Mobile friendly testing tool that helps to test a website is mobile friendly or not.",
      "url": "https://search.google.com/test/mobile-friendly?utm_source=mft&utm_medium=redirect&utm_campaign=mft-redirect"
    },

    {
      "title": "Ghostlab",
      "description": "Ghostlab is a Responsive Design Testing tool that allows to test responsive design of a website across a variety of devices and browsers. With so many mobile devices in the market, responsiveness of any UI is mandatory, especially for any new applications being built. The test is handled by few open source online tools at different screen sizes.",
      "url": "https://www.vanamco.com/ghostlab/"
    }
  ]
}
