{
   "2019": [
      {
        "title": "webpack",
        "description":"A bundler for javascript and friends. Packs many modules into a few bundled assets. Code Splitting allows to load parts for the application on demand. Through 'loaders,' modules can be CommonJs, AMD, ES6 modules, CSS, Images, JSON, Coffeescript, LESS, ... and your custom stuff.",
        "url": "https://webpack.js.org/"
      },
      {
        "title": "parceljs",
        "description":"Blazing fast, zero configuration web application bundler",
        "url": "https://parceljs.org/"
      },
      {
        "title": "CodeSandbox",
        "description":"CodeSandbox is an online editor that helps you create web applications, from prototype to deployment.",
        "url": "https://codesandbox.io/"
      },
      {
        "title": "angularjs",
        "description":"HTML is great for declaring static documents, but it falters when we try to use it for declaring dynamic views in web-applications. AngularJS lets you extend HTML vocabulary for your application. The resulting environment is extraordinarily expressive, readable, and quick to develop. Know more about AngularJS.",
        "url": "https://www.angularjs.org/"
      },

      {
        "title": "gulp",
        "description":"Gulp is a tool that helps you out with several tasks when it comes to web development. Gulp is a streaming build system, by using node’s streams file manipulation is all done in memory, and a file isn’t written until you tell it to do so. Get started with Gulp.",
        "url": "https://gulpjs.com/"
      },

      {
        "title": "Ember js",
        "description":"Ember is the spiritual successor to SproutCore, a powerful JavaScript framework that attempted to port the Cocoa UI to the web Get started with Ember.",
        "url": "https://emberjs.com/"
      },

      {
        "title": "Meteor",
        "description":"Meteor is a new full-stack JavaScript, powered by Node.js. It's guaranteed to revolutionize the way that you approach writing highly responsive and dynamic web applications. Get started with Meteor.",
        "url": "https://www.meteor.com/"
      },

      {
        "title": "sass",
        "description":"Sass is completely compatible with all versions of CSS. We take this compatibility seriously, so that you can seamlessly use any available CSS libraries. Get started with Sass.",
        "url": "http://sass-lang.com/"
      },

      {
        "title": "Yeoman",
        "description":"Yeoman helps you to kickstart new projects, prescribing best practices and tools to help you stay productive. To do so, we provide a generator ecosystem. A generator is basically a plugin that can be run with the `yo` command to scaffold complete projects or useful parts. Get started. ",
        "url": "http://yeoman.io/"
      },

      {
        "title": "Bower",
        "description":"Web sites are made of lots of things — frameworks, libraries, assets, and utilities. Bower manages all these things for you. Get started with Bower.",
        "url": "https://bower.io/"
      },

      {
        "title": "bootstrap",
        "description":"Sleek, intuitive, and powerful front-end framework for faster and easier web development. Get started with Bootstrap.",
        "url": "http://getbootstrap.com/"
      },

      {
        "title": "Foundation",
        "description":"A Framework for any device, medium, and accessibility. Foundation is a family of responsive front-end frameworks that make it easy to design beautiful responsive websites, apps and emails that look amazing on any device. Foundation is semantic, readable, flexible, and completely customizable. We’re constantly adding new resources and code snippets, including these handy HTML templates to help get you started! Get started with Foundation.",
        "url": "https://foundation.zurb.com//"
      },

      {
        "title": "HTML5 Boilerplate",
        "description":"HTML5 Boilerplate helps you build fast, robust, and adaptable web apps or sites. Kick-start your project with the combined knowledge and effort of 100s of developers, all in one little package. Get started with HTML5 Boilerplate.",
        "url": "https://html5boilerplate.com/"
      },

      {
        "title": "Normalize",
        "description":"Normalize makes all browsers render elements in as consistent a fashion as possible. Have you ever experienced the annoyance of debugging a three pixel input height inconsistency, from browser to browser? With Normalize, you'll never deal with that again! Dive deeper into Normalize.",
        "url": "http://necolas.github.io/normalize.css/"
      },
      {
        "title": "git",
        "description":"Git is a free distributed version control system. Android Studio comes with Git client. All we need to do is just enable and start using it. As a prerequisite, you need to have Git installed in the local system. Dive deeper into Git.",
        "url": "https://source.android.com/source/developing.html"
      },
      {
        "title": "Firebase",
        "description":"Firebase is a mobile platform that helps you quickly develop high-quality apps, grow your user base, and earn more money. Firebase is made up of complementary features that you can mix-and-match to fit your needs. Dive deeper into Firebase.",
        "url": "https://firebase.google.com/"
      }

   ]

}
