{
   "2018": [
      {
        "title": "Ethereum",
        "description":"Ethereum is a decentralized platform for applications that run exactly as programmed without any chance of fraud, censorship or third-party interference.",
        "url": "https://www.ethereum.org/"
      },

      {
        "title": "Hyperledger Indy",
        "description":"Hyperledger Indy is a distributed ledger, purpose-built for decentralized identity. It provides tools, libraries, and reusable components for creating and using independent digital identities rooted on blockchains or other distributed ledgers so that they are interoperable across administrative domains, applications, and any other 'silo'. Because distributed ledgers cannot be altered after the fact, it is essential that use cases for ledger-based identity carefully consider foundational components, including performance, scale, trust model, and privacy. In particular, Privacy by Design and privacy-preserving technologies are critically important for a public identity ledger where correlation can take place on a global scale. <br> For all these reasons, Hyperledger Indy has developed specifications, terminology, and design patterns for decentralized identity along with an implementation of these concepts that can be leveraged and consumed both inside and outside the Hyperledger Consortium.",
        "url": "https://www.hyperledger.org/projects/hyperledger-indy"
      },

      {
        "title": "Hyperledger Iroha ",
        "description":"Hyperledger Iroha is a blockchain platform implementation and one of the Hyperledger projects hosted by The Linux Foundation. Hyperledger Iroha is designed to be simple and easy to incorporate into infrastructural projects requires distributed ledger technology. Hyperledger Iroha features a simple construction; modern, domain-driven C++ design, emphasis on mobile application development and a new, chain-based Byzantine Fault Tolerant consensus algorithm, called Sumeragi. Hyperledger Iroha was initially contributed by Soramitsu, Hitachi, NTT Data and Colu.",
        "url": "https://www.hyperledger.org/projects/iroha"
      },

      {
        "title": "Sawtooth",
        "description":"Zend Framework is a collection of professional PHP packages with more than 76 million installations. It can be used to develop web applications and services using PHP 5.6+, and provides 100% object-oriented code using a broad spectrum of language features.Zend Framework 3 evolved from both Zend Framework 2 and 1.",
        "url": "https://www.hyperledger.org/projects/sawtooth"
      },

      {
        "title": "Solidity",
        "description":"Solidity is a contract-oriented, high-level language for implementing smart contracts. It was influenced by C++, Python and JavaScript and is designed to target the Ethereum Virtual Machine (EVM).",
        "url": "https://solidity.readthedocs.io/en/v0.4.23/"
      }
   ]

}
